# SetDownFromBottom Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeSettings..::..SetDownFromBottom Property
PipeSettings Class See Also
---
The abbreviation of the Set Down from bottom of fitting (SDB) string.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public string SetDownFromBottom { get; set; }
```

Visual Basic
---
```text
Public Property SetDownFromBottom As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ SetDownFromBottom {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace